{
  "index": {
    "page_title": "Blog",
    "source": "blog",
    "sub_page": false,
    "description": "My blog about front end development, things I come across while coding and the meetings/conferences I attended."
  },
  "sass-fontcustom": {
    "page_title": "Font icons with Fontcustom and SASS",
    "source": "blog",
    "date": "05-08-2015",
    "sub_page": "sass-fontcustom",
    "description": "In 2013 and 2014 I used Icomoon to create font icons. It is a nice library and tool. You can choose icons from their library and they have the feature to upload your own svgs to create the font icon set. It is a great tool if you only need to generate the font icon once. But not when you have add new ones to the set."
  },
  "rating-stars-sass": {
    "page_title": "Create clickable rating stars with only SASS and HTML",
    "source": "blog",
    "date": "03-07-2015",
    "sub_page": "rating-stars-sass",
    "description": "In May, Roy Tomeij wrote the article 'Configurable star rating without JS'. I was thinking how to do this using a font icon instead of a background image and make the stars clickable. I believe it would take less code to write, and it is."
  },
  "customize-django-crispy-forms": {
    "page_title": "Django form customization using Crispy Forms",
    "source": "blog",
    "date": "21-09-2014",
    "sub_page": "customize-django-crispy-forms",
    "description": "At Dreamsolution we regularly use Crispy Forms to generate  complex forms in Django. I want to share some practical customization examples with Crispy Forms using the formhelper API."
  },
  "customize-sublime": {
    "page_title": "Customize Sublime text editor",
    "source": "blog",
    "date": "12-02-2014",
    "sub_page": "customize-sublime",
    "description": "At the Fronteers conference 2012 in Amsterdam, Addy Osmani used Sublime Text Editor in his presentation. The editor looked really interesting. Right after the conference I installed Sublime and looked around for packages which would make my life as front end developer easier and make editing more fun. This article is a small tutorial with tips to configure Sublime to your needs, a list of interesting packages, how to customize a theme and links to useful documentation."
  },
  "cssday2013": {
    "page_title": "CSS Day 2013",
    "source": "blog",
    "date": "16-06-2013",
    "sub_page": "cssday2013",
    "description": "Friday 14 june in Amsterdam I attended the CSSDay conference. Eight experts talked about 8 different CSS modules. The focus was on techniques of these modules we might not know about and the future of CSS. During the conference I learned that CSS is in very active development. It was an incredible, informative and awesome day. An high standard conference I've ever attended so far. I hope that there will be another one within 1 or 2 years."
  }
}